examples/aachenBomb/aachenBomb/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

decomposer      scotch;

distributor     zoltan;

libs            ( "libzoltanDecomp.so" );

simpleCoeffs
{
    n               ( 2 2 3 );
}

zoltanCoeffs
{
    lb_method       rcb;
}


// ************************************************************************* //
